## Exercise:

Write pandas to report all the consecutive available seats in the cinema.

Return the result table ordered by seat_id in ascending order.

The test cases are generated so that more than two seats are consecutively available.

The query result format is in the following example.

In [28]:
import pandas as pd

data = {'seat_id': [1, 2, 3, 4, 5], 'free': [1, 0, 1, 1, 1]}

cinema_df = pd.DataFrame(data)
cinema_df

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1

In [29]:
cinema_df.describe()

        seat_id      free
count  5.000000  5.000000
mean   3.000000  0.800000
std    1.581139  0.447214
min    1.000000  0.000000
25%    2.000000  1.000000
50%    3.000000  1.000000
75%    4.000000  1.000000
max    5.000000  1.000000

In [30]:
cinema_df.dtypes

seat_id    int64
free       int64
dtype: object

In [31]:
cinema_df.columns

Index(['seat_id', 'free'], dtype='object')

In [32]:
cinema_df

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1

In [33]:
cond = cinema_df['free'].diff() >= 0
results_df = cinema_df[cond]
results_df

   seat_id  free
2        3     1
3        4     1
4        5     1

In [34]:
results_df = results_df[['seat_id']].reset_index(drop=True)
results_df

   seat_id
0        3
1        4
2        5

In [35]:
expected_data = {'seat_id': [3, 4, 5]}
expected_df = pd.DataFrame(expected_data)

In [36]:
# Check that the filtered dataframe is equal to the expected dataframe
pd.testing.assert_frame_equal(results_df, expected_df, check_dtype=False, check_index_type=False, check_like=True)

In [38]:
data = {'seat_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'free': [1, 0, 1, 1, 1, 0, 0, 1, 1, 1]}
cinema_df = pd.DataFrame(data)
cinema_df

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1
5        6     0
6        7     0
7        8     1
8        9     1
9       10     1

In [41]:
cond = (cinema_df['free'].diff() >= 0) & (cinema_df['free'] == 1)
results_df = cinema_df[cond]
results_df

   seat_id  free
2        3     1
3        4     1
4        5     1
7        8     1
8        9     1
9       10     1